&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");
	
	Если ПроверитьСуществованиеТоваров(НазваниеТовара) Тогда
		ТекстСообщение = СтрШаблон("Товар %1 найден!", НазваниеТовара);
	Иначе
		ТекстСообщение = СтрШаблон("Товар %1 не найден!", НазваниеТовара);
	КонецЕсли;
	
	Сообщить(ТекстСообщение);
КонецПроцедуры

Функция ПроверитьСуществованиеТоваров(НазваниеТовара)
	ТаблицаТоваров = Новый ТаблицаЗначений();
	ТаблицаТоваров.Колонки.Добавить("Название");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	
	СтрокаТовара = ТаблицаТоваров.Добавить();
	СтрокаТовара.Название = "Гитара";
	СтрокаТовара.Цена = 100;
	
	СтрокаТовара = ТаблицаТоваров.Добавить();
	СтрокаТовара.Название = "Микрофон";
	СтрокаТовара.Цена = 50;
	
	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеПоНазванию(НазваниеТовара);
	Возврат ТоварСуществует;
КонецФункции